### Terraform Plan Output Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  
  ```terraform

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine_scale_set.rsi-frontend-vmss will be created
  + resource "azurerm_linux_virtual_machine_scale_set" "rsi-frontend-vmss" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "azureuser"
      + computer_name_prefix                              = "rsi-vm-fe-"
      + custom_data                                       = (sensitive value)
      + disable_password_authentication                   = false
      + do_not_run_extensions_on_overprovisioned_machines = false
      + extension_operations_enabled                      = (known after apply)
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = "uksouth"
      + max_bid_price                                     = -1
      + name                                              = "rsi-vmss-fe"
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "rsi-dev-rg"
      + scale_in_policy                                   = (known after apply)
      + single_placement_group                            = true
      + sku                                               = "Standard_D2a_v4"
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Manual"
      + zone_balance                                      = false

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "rsi-fe-nic"
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = [
                  + "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/loadBalancers/fe-lb/backendAddressPools/BackEndAddressPool",
                ]
              + name                                   = "internal"
              + primary                                = true
              + subnet_id                              = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/virtualNetworks/rsi-fe-vnet/subnets/frontend"
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts"
          + version   = "latest"
        }
    }

  # azurerm_log_analytics_workspace.rsi-law will be created
  + resource "azurerm_log_analytics_workspace" "rsi-law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "uksouth"
      + name                            = "rsi-dev-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rsi-dev-rg"
      + retention_in_days               = 7
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

  ```
  </details>
  
  *Pusher: @MartyFox, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Pull Request Plan`*